In [1]:
import pandas as pd
import random
from src.deflator import deflate

Building an synthetic dataset. 

Important to notice that in yearly values the date column **must** be `int` type:

In [3]:
# building yearly synthetic dataset
yearly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2000", end="2018", freq="Y")
        .strftime("%Y")
        .astype("int"),  # selecting only the year and turning it into INT
        "value": [random.random() for i in range(len(pd.date_range(start="2000", end="2018", freq="Y")))],
    }
)
yearly_df.head()

   date     value
0  2000  0.065055
1  2001  0.182301
2  2002  0.208570
3  2003  0.675595
4  2004  0.330354

In [3]:
# using the function with a yearly value deflating to  IPCA's 2001 values:

deflate(
    data_frame=yearly_df, 
    value_column="value", 
    date_column="date", 
    deflate_year=2001
).head()

   date     value  deflated_value
0  2000  0.170941        0.219547
1  2001  0.728484        0.728484
2  2002  0.074239        0.045464
3  2003  0.731300        0.603363
4  2004  0.624021        0.630093

When using monthly values, the date column **must** have the **"YYYY-MM"** format as `object`:

In [4]:
# monthly synthetic dataset:

monthly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2001", end="2006", freq="M").strftime("%Y-%m"),
        "value": [
            random.random()
            for i in range(len(pd.date_range(start="2001", end="2006", freq="M")))
        ],
    }
)
monthly_df.head()

      date     value
0  2001-01  0.694808
1  2001-02  0.560342
2  2001-03  0.703995
3  2001-04  0.890674
4  2001-05  0.755169

In [5]:
#deflating the series to IPCA's 2005-01 values:
deflate(
    data_frame=monthly_df,
    value_column="value",
    date_column="date",
    deflate_year=2005,
    deflate_month=1,
).head()

      date     value  deflated_value
0  2001-01  0.694808        0.749951
1  2001-02  0.560342        0.762066
2  2001-03  0.703995        1.329768
3  2001-04  0.890674        1.211317
4  2001-05  0.755169        1.047990